Tutorials/RNGkEpsilon/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            cyclic;
        nFaces          160;
        startFace       60181;
        featureCos      0.9;
    }
    bottom
    {
        type            wall;
        nFaces          379;
        startFace       60341;
    }
    atmosphere
    {
        type            patch;
        nFaces          379;
        startFace       60720;
    }
    frontBack
    {
        type            empty;
        nFaces          60640;
        startFace       61099;
    }
)

// ************************************************************************* //
